# This Python file uses the following encoding: utf-8

#　reference:　http://wx.shangdiguo.com/blog.asp?wenzhangid=35658

checkedToneChars = (
    # 入声字表

    # 分部（823个）
    # 一屋[-uk]
    u"屋木竹目服福祿熟谷肉咒鹿腹菊陸軸逐牧伏宿讀犢瀆牘櫝黷轂复粥肅育六縮哭幅斛戮僕畜蓄叔淑菽獨"
    u"卡馥沐速祝麓鏃蹙築穆睦啄覆鶩禿撲鬻輻瀑竺簇暴掬濮鬱矗复塾樸蹴煜謖碌毓舳柚蝠轆夙蝮匐觫囿苜茯髑副孰谷"
    # 二沃[-uuk]
    u"沃俗玉足曲粟燭屬錄辱獄綠毒局欲束鵠蜀促觸續督贖浴酷矚躅褥旭欲淥逯告僕"
    # 三覺[-eok]
    u"覺角桷較岳樂捉朔數卓汲琢剝趵爆駁邈雹璞樸確濁擢鐲濯幄喔藥握搦學"
    # 四質[-it]
    u"質日筆出室實疾術一乙壹吉秩密率律逸佚失漆栗畢卹蜜橘溢瑟膝匹黜弼七叱"
    u"卒蝨悉謐軼詰戌佶櫛暱窒必侄蛭泌秫蟀嫉唧怵帥聿郅桎茁汨尼蒺"
    # 五物[-ot]
    u"物佛拂屈鬱乞掘訖吃紱弗詘崛勿熨厥迄不屹芴倔尉蔚"
    # 六月[-jat]
    u"月骨發闕越謁沒伐罰卒竭窟笏鉞歇突忽勃蹶筏厥蕨掘閥訥歿粵悖兀碣猝樾羯汨咄渤凸滑孛核餑垡閼堀曰訐"
    # 七曷[-at]
    u"曷達末闊活缽脫奪褐割沫拔葛渴撥豁括聒抹秣遏撻薩掇喝跋獺撮剌潑斡捋襪適咄妲"
    # 八黠[-aet]
    u"黠札拔猾八察殺剎軋刖戛秸嘎瞎刮刷滑"
    # 九屑[-et]
    u"屑節雪絕列烈結穴說血舌潔別裂熱決鐵滅折拙切悅轍訣洩咽噎傑徹別哲設劣碣掣譎竊"
    u"綴閱抉挈捩楔蹩褻蔑捏竭契癤涅頡擷撤跌蔑浙澈蛭揭啜輟迭吶侄冽掇批橇"
    # 十藥[-ak]
    u"藥薄惡略作樂落閣鶴爵若約腳雀幕洛壑索郭博錯躍若縛酌托削鐸灼鑿卻絡"
    u"鵲度諾橐漠鑰著虐掠獲泊搏勺酪謔廓綽霍爍莫鑠繳諤鄂亳恪箔攫涸瘧郝駱膜粕礴拓蠖鱷格昨柝摸貉愕柞寞膊魄烙焯厝噩澤矍各獵昔芍踱迮"
    # 十一陌[-eak]
    u"陌石客白澤伯跡宅席策碧籍格役帛戟璧驛麥額柏魄積脈夕液冊尺隙逆畫百"
    u"辟赤易革脊獲翮屐適劇磧隔益柵窄核擲責惜僻癖闢掖腋釋舶拍擇摘射斥弈"
    u"奕迫疫譯昔瘠赫炙謫虢臘碩螫藉翟亦鬲骼鯽借嘖蜴幗席貊汐摭咋嚇剌百莫蟈繹霸霹"
    # 十二錫[-ek]
    u"錫壁歷櫪擊績笛敵滴鏑檄激寂翟逖糴析晰溺覓摘狄荻戚滌的吃霹瀝惕踢剔礫櫟適嫡鬩覡淅晰吊霓倜"
    # 十三職[-jik]
    u"職國德食蝕色力翼墨極息直得北黑側飾賊刻則塞式軾域殖植敕飭棘惑默織匿億憶特勒劾仄稷識逼克"
    u"蜮唧即拭弋陟測冒抑惻肋亟殛忒嶷熄穡嗇匐鯽或愎翌"
    # 十四緝[-ip]
    u"緝輯立集邑急入泣濕習給十拾什襲及級澀粒揖汁蟄笠執隰汲吸熠岌歙熠挹"
    # 十五合[-op]
    u"合塔答納榻雜臘蠟匝闔蛤衲遝鴿踏颯拉盍搭溘嗑"
    # 十六葉[-ep]
    u"葉帖貼牒接獵妾蝶篋涉捷頰楫攝躡諜協俠莢睫懾蹀挾喋燮褶靨燁摺輒捻婕聶霎"
    # 十七洽[-aep]
    u"洽狹峽法甲業鄴匣壓鴨乏怯劫脅插押狎掐夾恰眨呷喋札鉀"
)
